`Pandas` is a data manipulation library. 2 primary Datastructures<br>
-Series -1 Dimensional <br>
-DataFrame -2 dimensional

In [1]:
import pandas as pd

In [6]:
# Series from List
data  =[1,2,3,4,5]
ser1 = pd.Series(data)
print(ser1)
print(type(ser1))
print(ser1.dtype)

# Series from dict
#Dictionary key becomes the index
data_dict ={'a':1,'b':2,'c':3}
ser2 = pd.Series(data_dict)
print(ser2['a'])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
int64
1

In [7]:
#Dataframe :Structures as rows and columns ,similar to excel 
data ={
    'Name':['Thaju','Haries','Muthu'],
    'Age' :[25,30,33]
}

df = pd.DataFrame(data)
display(df)

     Name  Age
0   Thaju   25
1  Haries   30
2   Muthu   33

In [9]:
# Create a datframe from a list of dictionary
data =[
    {'Name':'Thaju','Age':25},
    {'Name':'Haries','Age':30},
    {'Name':'Amju','Age':33},
    {'Name':'Fadhu','Age':7}
]

df2 = pd.DataFrame(data)
display(df2)

     Name  Age
0   Thaju   25
1  Haries   30
2    Amju   33
3   Fadhu    7

In [11]:
# Accessing Data from DF
print(df2['Name'])
print(type(df2['Name']))

0     Thaju
1    Haries
2      Amju
3     Fadhu
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

`df.at[row,col_index]` for picking the exact elemet

In [15]:
print(df2.at[1,'Name'])

Haries

In [18]:
#Adding a new column in pandas
df['location'] =['Banglore','Chennai','Kottngal']
display(df)
# dropping a column in pandas
df.drop(['location'],axis =1,inplace =True)
display(df)

     Name  Age  location
0   Thaju   25  Banglore
1  Haries   30   Chennai
2   Muthu   33  Kottngal

     Name  Age
0   Thaju   25
1  Haries   30
2   Muthu   33